driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/src/jbiServiceUnits/TerminationHandlerBpel/ExplicitTH_Compensate/IOWSDL7.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IOWSDL7" targetNamespace="http://j2ee.netbeans.org/wsdl/IOWSDL7"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://j2ee.netbeans.org/wsdl/IOWSDL7">
    <types/>
    <message name="IOWSDL7OperationRequest">
        <part name="InputPart" type="xsd:string"/>
    </message>
    <message name="IOWSDL7OperationReply">
        <part name="OutputPart" type="xsd:string"/>
    </message>
    <portType name="IOWSDL7PortType">
        <wsdl:operation name="IOWSDL7Operation">
            <wsdl:input name="input1" message="tns:IOWSDL7OperationRequest"/>
            <wsdl:output name="output1" message="tns:IOWSDL7OperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="IOWSDL7Binding" type="tns:IOWSDL7PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="IOWSDL7Operation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL7"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL7"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="IOWSDL7Service">
        <wsdl:port name="IOWSDL7Port" binding="tns:IOWSDL7Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/TerminationHandlerBpel/ExplicitTH_Compensate/IOWSDL7Service/IOWSDL7Port"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="IOWSDL7Plink">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="IOWSDL7PortTypeRole" portType="tns:IOWSDL7PortType"/>
    </plnk:partnerLinkType>
</definitions>
